review_api/app/controllers/employeereviews_controller.rb

  def index
    @employeereviews = Employeereview.all
---
SELECT "employeereviews".* FROM "employeereviews"

    def set_employeereview
      @employeereview = Employeereview.find(params[:id])
---
SELECT "employeereviews".* FROM "employeereviews" WHERE "employeereviews"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]