server/app/controllers/employees_controller.rb

INSERT INTO "employees" ("first_name", "last_name", "job_title", "department", "profile_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)

    if @employee.save

UPDATE "employees" SET "first_name" = $1, "last_name" = $2, "job_title" = $3, "department" = $4, "updated_at" = $5 WHERE "employees"."id" = $6  [["first_name", "Adesegun"], ["last_name", "Adedeji"], ["job_title", "software Developer"], ["department", "Microsoft"], ["updated_at", "2020-05-26 01:09:42.248982"], ["id", 1]]
---
  def update
    if @employee.update(employee_params)